app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT `doctors`.* FROM `doctors`

    def set_doctor
      @doctor = Doctor.find(params[:id])
---
SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 0 LIMIT 1